app/Views/admin/templates/header.php

SELECT *
FROM `roles`
WHERE `role_id` = '1'
 LIMIT 1
---
                        style="background-image: url(<?=base_url('assets/images/user.png')?>)"></span>
                    <div class="d-none d-xl-block ps-2">
                        <div><?=session()->get('fullname')?></div>
                        <div class="mt-1 small text-secondary"><?=session()->get('role')?></div>