app/Controllers/Administrator.php

SELECT *
FROM `students`
WHERE `status` = 1
---
    public function cadetInformation()
    {
        $title = 'Cadets';
        //students
        $studentModel = new \App\Models\studentModel();
        $students = $studentModel->WHERE('status',1)->findAll();

SELECT *
FROM `cadets`
ORDER BY `cadet_id` DESC
 LIMIT 5
---
    public function register()
    {
        $title = "Register";
        //recent cadets
        $cadetModel = new \App\Models\cadetModel();
        $cadet = $cadetModel->orderBy('cadet_id','DESC')->limit(5)->findAll();