app/Controllers/Administrator.php

SELECT *
FROM `accounts`
WHERE `account_id` = '1'
 LIMIT 1
SELECT *
FROM `roles`
WHERE `role_id` = '1'
 LIMIT 1
---
    public function hasPermission($page)
    {
        $roleModel = new \App\Models\roleModel();
        $accountModel = new \App\Models\accountModel();
        $account = $accountModel->WHERE('account_id',session()->get('loggedAdmin'))->first();
        $role = $roleModel->WHERE('role_id',$account['role_id'])->first();

SELECT *
FROM `announcement`
ORDER BY `announcement_id` DESC
 LIMIT 5
---
    public function index()
    {
        $title = 'Overview';
        //announcement
        $announcementModel = new \App\Models\announcementModel();
        $announcement = $announcementModel->orderBy('announcement_id','DESC')->limit(5)->findAll();

SELECT *
FROM `students`
WHERE `token` = '52fd77de7e08a77c08d936b43bb69cc6b0686896e28bb220e135b19fa27e0122'
 LIMIT 1
---
    public function cadetInfo($id)
    {
        if(!$this->hasPermission('cadet'))
        {
            return redirect()->to('/dashboard')->with('fail', 'You do not have permission to access that page!');
        }
        else
        {
            $data['title'] = 'View Cadet';
            $studentModel = new studentModel();
            $info = new cadetModel();
            $attachment = new \App\Models\attachmentModel();
            $student = $studentModel->where('token',$id)->first();