app/Controllers/Home.php

    public function studentDashboard()
    {
        $session = session();
        if($session->get('loggedUser') == null)
        {
            return redirect()->to(base_url('/'));
        }
        else
        {
            //check if cadets is empty
            $cadetModel = new cadetModel();
            $cadet = $cadetModel->where('student_id',session()->get('loggedUser'))->first();
            if(empty($cadet))
            {
                return redirect()->to(base_url('cadet/profile'));
            }
            $data['fullname'] = $session->get('fullname');
            $data['title']= 'Dashboard';
            //announcement
            $model = new \App\Models\announcementModel();
            $data['announcement'] = $model->orderBy('announcement_id','DESC')->limit(5)->findAll();
            //favorites
            $favorite = new favoriteModel();
            $data['favorite'] = $favorite->where('student_id',session()->get('loggedUser'))->findAll();
---
SELECT *
FROM `cadets`
WHERE `student_id` = '1'
 LIMIT 1
SELECT *
FROM `announcement`
ORDER BY `announcement_id` DESC
 LIMIT 5
SELECT *
FROM `favorites`
WHERE `student_id` = '1'

    public function studentProfile()
    {
        $data['title'] = "Cadet Profile";
        $cadetModel = new cadetModel();
        $data['cadet'] = $cadetModel->where('student_id',session()->get('loggedUser'))->first();
---
SELECT *
FROM `cadets`
WHERE `student_id` = '1'
 LIMIT 1

    public function upload()
    {
        $data['title']="Upload File";
        $attachmentModel = new \App\Models\attachmentModel();
        $data['attachment'] = $attachmentModel->where('student_id',session()->get('loggedUser'))->first();
---
SELECT *
FROM `attachments`
WHERE `student_id` = '1'
 LIMIT 1

    public function studentTrainings()
    {
        $data['title'] = "My Trainings";
        //check if cadets is empty
        $cadetModel = new cadetModel();
        $cadet = $cadetModel->where('student_id',session()->get('loggedUser'))->first();
---
SELECT *
FROM `cadets`
WHERE `student_id` = '1'
 LIMIT 1

    public function studentAttendance()
    {
        $data['title'] = "My Attendance";
        //check if cadets is empty
        $cadetModel = new cadetModel();
        $cadet = $cadetModel->where('student_id',session()->get('loggedUser'))->first();
        if(empty($cadet))
        {
            return redirect()->to(base_url('cadet/profile'));
        }
        $qrcodeModel = new qrcodeModel();
        $attendanceModel = new attendanceModel();
        //total attendance
        $data['totalAttendance'] = $attendanceModel->where('student_id',session()->get('loggedUser'))
                        ->whereIn('remarks',['In','Out'])
                        ->groupBy('date')
                        ->countAllResults();
        //late attendance
        $data['late'] = $attendanceModel->where('student_id',session()->get('loggedUser'))
                        ->where('remarks','In')
                        ->where('time >','08:00')
                        ->countAllResults();
        $data['qrcode'] = $qrcodeModel->where('student_id',session()->get('loggedUser'))->first();
        $data['attendance'] = $attendanceModel->where('student_id',session()->get('loggedUser'))
                                ->orderBy('attendance_id','DESC')->limit(10)
                                ->findAll();
        $summary = $this->db->table('attendance a')
                    ->select('a.date,b.school_id,
                    MAX(CASE WHEN a.remarks = "Out" THEN a.time END) timeOut,
                    MIN(CASE WHEN a.remarks = "In" THEN a.time END) timeIn,
                    SEC_TO_TIME(TIME_TO_SEC(TIMEDIFF(
                            MAX(CASE WHEN a.remarks = "Out" THEN a.time END),
                            MIN(CASE WHEN a.remarks = "In" THEN a.time END)
                        ))) AS hours,a.token')
                    ->join('students b','b.student_id=a.student_id','LEFT')
                    ->where('a.student_id',session()->get('loggedUser'))
                    ->groupBy('a.date,a.student_id')
                    ->get()->getResult();
---
SELECT *
FROM `cadets`
WHERE `student_id` = '1'
 LIMIT 1
SELECT *
FROM `qrcodes`
WHERE `student_id` = '1'
 LIMIT 1
SELECT *
FROM `attendance`
WHERE `student_id` = '1'
ORDER BY `attendance_id` DESC
 LIMIT 10
SELECT `a`.`date`, `b`.`school_id`, MAX(CASE WHEN a.remarks = "Out" THEN a.time END) timeOut, MIN(CASE WHEN a.remarks = "In" THEN a.time END) timeIn, SEC_TO_TIME(TIME_TO_SEC(TIMEDIFF(
                                MAX(CASE WHEN a.remarks = "Out" THEN a.time END), MIN(CASE WHEN a.remarks = "In" THEN a.time END)
                            ))) AS hours, `a`.`token`
FROM `attendance` `a`
LEFT JOIN `students` `b` ON `b`.`student_id`=`a`.`student_id`
WHERE `a`.`student_id` = '1'
GROUP BY `a`.`date`, `a`.`student_id`